In [9]:
pip install numpy

Requirement already satisfied: numpy in c:\users\109-1\appdata\local\programs\python\python312\lib\site-packages (2.2.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
pip install pandas

^C
Note: you may need to restart the kernel to use updated packages.

  WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ConnectTimeoutError(<pip._vendor.urllib3.connection.HTTPSConnection object at 0x0000023FCD883DD0>, 'Connection to files.pythonhosted.org timed out. (connect timeout=15)')': /packages/29/d4/1244ab8edf173a10fd601f7e13b9566c1b525c4f365d6bee918e68381889/pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata
  WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ConnectTimeoutError(<pip._vendor.urllib3.connection.HTTPSConnection object at 0x0000023FCC2C81A0>, 'Connection to files.pythonhosted.org timed out. (connect timeout=15)')': /packages/29/d4/1244ab8edf173a10fd601f7e13b9566c1b525c4f365d6bee918e68381889/pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\109-1\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\109-1\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.4/11.5 MB 11.6 MB/s eta 0:00:01
   ---- ----------------------------------- 1.3/11.5 MB 17.1 MB/s eta 0:00:01
   ---- ----------------------------------- 1.3/11.5 MB 17.1 MB/s eta 0:00:01
   ---- ----------------------------------- 1.3/11.5 MB 17.1 MB/s eta 0:00:01
   ---- ----------------------------------- 1.3/11.5 MB 17.1 MB/s eta 0:00:01
   ---- ----------------------------------- 1.3/11.5 MB 17.1 MB/s eta 0:00:01
   ---- ----------------------------------- 1.4/11.5 MB 4.6 MB/s eta 0:00:03
   ------ --------------------------------- 1.8/11.5 MB 5.3 MB/s eta 0:00:02
   ------- -------------------------------- 2.1/11.5 MB 5.5 MB/s eta 0:00:02
   -------- ------------------------------- 2.5/11.5 MB 5.7 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/11.5 MB 6.2 MB/s eta 0:00:02
   ---------- ----------------------------- 3.1/11.5 MB 6.3 MB/s eta 0:00:02
   ---------- ----------------------------- 3.1/11.5 MB 6.3 MB/s eta 0:00:02
   ---------- ----------------------------- 3.1/11.5 MB 6.3 MB/s eta 0:00:02
   ---------- ----------------------------- 3.1/11.5 MB 6.3 MB/s eta 0:00:02
   ---------- ----------------------------- 3.1/11.5 MB 6.3 MB/s eta 0:00:02
   ---------- ----------------------------- 3.1/11.5 MB 6.3 MB/s eta 0:00:02
   ----------- ---------------------------- 3.2/11.5 MB 4.0 MB/s eta 0:00:03
   ------------ --------------------------- 3.6/11.5 MB 4.2 MB/s eta 0:00:02
   ------------- -------------------------- 3.7/11.5 MB 4.1 MB/s eta 0:00:02
   ------------- -------------------------- 3.9/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.1/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 4.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 3.2 MB/s eta 0:00:03
   -------------- ------------------------- 4.3/11.5 MB 3.2 MB/s eta 0:00:03
   -------------- ------------------------- 4.3/11.5 MB 3.1 MB/s eta 0:00:03
   --------------- ------------------------ 4.4/11.5 MB 3.1 MB/s eta 0:00:03
   ---------------- ----------------------- 4.7/11.5 MB 3.2 MB/s eta 0:00:03
   ----------------- ---------------------- 5.0/11.5 MB 3.3 MB/s eta 0:00:02
   ------------------- -------------------- 5.5/11.5 MB 3.5 MB/s eta 0:00:02
   --------------------- ------------------ 6.3/11.5 MB 3.9 MB/s eta 0:00:02
   ------------------------ --------------- 7.0/11.5 MB 4.2 MB/s eta 0:00:02
   --------------------------- ------------ 7.9/11.5 MB 4.7 MB/s eta 0:00:01
   ------------------------------ --------- 8.6/11.5 MB 5.0 MB/s eta 0:00:01
   -------------------------------- ------- 9.5/11.5 MB 5.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.8/11.5 MB 5.4 MB/s eta 0:00:01
   ---------------------------------- ----- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.5 MB 5.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.3/11.5 MB 4.5 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 4.4 MB/s eta 0:00:01
   -------------------------------------- - 11.2/11.5 MB 4.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 4.3 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
   ---------------------------------------- 0.0/508.0 kB ? eta -:--:--
   --------------------------------------  501.8/508.0 kB 10.5 MB/s eta 0:00:01
   --------------------------------------- 508.0/508.0 kB 10.6 MB/s eta 0:00:00
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
   ---------------------------------------- 0.0/346.6 kB ? eta -:--:--
   --------------------------------------- 346.6/346.6 kB 10.8 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [22]:
import numpy as np
import pandas as pd

s = pd.Series([1, 3, 5, np.nan, 6, 8], name='first')
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
Name: first, dtype: float64

In [23]:
s.name

'first'

In [24]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [25]:
s.values

array([ 1.,  3.,  5., nan,  6.,  8.])

In [26]:
s.shape

(6,)

In [27]:
s.size

6

In [28]:
import pandas as pd

age = pd.Series([9, 17, 32, 45, 65, 98], index=list('abcdef'), name='age')
age

a     9
b    17
c    32
d    45
e    65
f    98
Name: age, dtype: int64

In [29]:
age['b']

np.int64(17)

In [30]:
age[[1, 3, 5]]

C:\Users\109-1\AppData\Local\Temp\ipykernel_18220\1546391730.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  age[[1, 3, 5]]

b    17
d    45
f    98
Name: age, dtype: int64

In [31]:
age[['a', 'f', 'd']]

a     9
f    98
d    45
Name: age, dtype: int64

In [32]:
age[['c']]

c    32
Name: age, dtype: int64

In [33]:
import pandas as pd

s =  pd.Series([3, 6, -3, 0, -4, 8, -7])
s

0    3
1    6
2   -3
3    0
4   -4
5    8
6   -7
dtype: int64

In [34]:
s > 0

0     True
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [35]:
s%2 == 0

0    False
1     True
2    False
3     True
4     True
5     True
6    False
dtype: bool

In [36]:
s[s > 0]

0    3
1    6
5    8
dtype: int64

In [37]:
s[~(s > 0)]

2   -3
3    0
4   -4
6   -7
dtype: int64

In [38]:
s[s%2 == 0]

1    6
3    0
4   -4
5    8
dtype: int64

In [39]:
s[s%2 != 0]

0    3
2   -3
6   -7
dtype: int64

In [40]:
s[(s > 0) & (s%2 == 0)]

1    6
5    8
dtype: int64

In [42]:
import numpy as np
import pandas as pd

s = ['희빈', '수영', '현수', '지호', '지민']
p = pd.Series([99, 84, 92, 65, 78], index=s)
p

희빈    99
수영    84
현수    92
지호    65
지민    78
dtype: int64

In [43]:
p.name = '수학성적'
p.index.name = 'st_name'
p

st_name
희빈    99
수영    84
현수    92
지호    65
지민    78
Name: 수학성적, dtype: int64

In [44]:
p.sort_values()

st_name
지호    65
지민    78
수영    84
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [45]:
p.sort_values(ascending=False)

st_name
희빈    99
현수    92
수영    84
지민    78
지호    65
Name: 수학성적, dtype: int64

In [46]:
p.sort_index()

st_name
수영    84
지민    78
지호    65
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [47]:
p.sort_index(ascending=False)

st_name
희빈    99
현수    92
지호    65
지민    78
수영    84
Name: 수학성적, dtype: int64

In [48]:
import numpy as np
import pandas as pd

s = ['희빈', '수영', '현수', '지호', '지민']
p = pd.Series([99, 84, 92, 65, 78], index=s)
p

희빈    99
수영    84
현수    92
지호    65
지민    78
dtype: int64

In [49]:
print(p.max())
print(p.min())

99
65

In [50]:
print(p.mean())
print(p.median())

83.6
84.0

In [51]:
print(p.count())
print(p.size)

5
5

In [52]:
p.describe()

count     5.000000
mean     83.600000
std      13.088163
min      65.000000
25%      78.000000
50%      84.000000
75%      92.000000
max      99.000000
dtype: float64

In [53]:
import numpy as np
import pandas as pd

s = pd.Series([3, 1, 1, 2, None, np.nan, 4, 6, 6, np.nan])
s

0    3.0
1    1.0
2    1.0
3    2.0
4    NaN
5    NaN
6    4.0
7    6.0
8    6.0
9    NaN
dtype: float64

In [54]:
s.values

array([ 3.,  1.,  1.,  2., nan, nan,  4.,  6.,  6., nan])

In [55]:
s.count()

np.int64(7)

In [56]:
s.value_counts()

1.0    2
6.0    2
3.0    1
2.0    1
4.0    1
Name: count, dtype: int64

In [57]:
s.value_counts(dropna=False)

NaN    3
1.0    2
6.0    2
3.0    1
2.0    1
4.0    1
Name: count, dtype: int64

In [58]:
import numpy as np
import pandas as pd

s = pd.Series([3, 1, 1, 2, None, np.nan, 4, 6, 6, np.nan])
s

0    3.0
1    1.0
2    1.0
3    2.0
4    NaN
5    NaN
6    4.0
7    6.0
8    6.0
9    NaN
dtype: float64

In [59]:
s.value_counts(sort=False, dropna=False)

3.0    1
1.0    2
2.0    1
NaN    3
4.0    1
6.0    2
Name: count, dtype: int64

In [60]:
s.value_counts(bins=4)

(0.994, 2.25]    3
(4.75, 6.0]      2
(2.25, 3.5]      1
(3.5, 4.75]      1
Name: count, dtype: int64

In [61]:
s.value_counts(bins=4, sort=False)

(0.994, 2.25]    3
(2.25, 3.5]      1
(3.5, 4.75]      1
(4.75, 6.0]      2
Name: count, dtype: int64

In [62]:
s.value_counts(bins=[0.5, 3.5, 6.5], sort=False)

(0.499, 3.5]    4
(3.5, 6.5]      3
Name: count, dtype: int64

In [65]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [10, 20, 30], [100, 200, 300]], index=list('abc'))
df

     0    1    2
a    1    2    3
b   10   20   30
c  100  200  300

In [73]:
df = pd.DataFrame([[1, 2, 3], [10, 20, 30], [100, 200, 300]],
                   index=list('abc'), columns=['A', 'B', 'C'])
df

     A    B    C
a    1    2    3
b   10   20   30
c  100  200  300

In [70]:
print(df.index)
print(df.columns)

Index(['a', 'b', 'c'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

In [74]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name ='courses')
courses

0      Spark
1    PySpark
2     Hadoop
Name: courses, dtype: object

In [75]:
fees = pd.Series([250000, 300000, 200000], name = 'fees')
fees

0    250000
1    300000
2    200000
Name: fees, dtype: int64

In [76]:
df = pd.DataFrame({courses.name: courses, fees.name: fees})
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [77]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name ='courses')
fees = pd.Series([250000, 300000, 200000], name = 'fees')

df = pd.concat([courses,fees], axis=1)
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [78]:
courses = pd.Series(["Spark", "PySpark", "Hadoop"], name ='courses')
fees = pd.Series([250000, 300000, 200000], name = 'fees')

df = pd.concat([courses,fees])
df

0      Spark
1    PySpark
2     Hadoop
0     250000
1     300000
2     200000
dtype: object

In [79]:
df = pd.DataFrame({'A': pd.Series([10, 20, 30], index=[0, 1, 2]),
                   'B': pd.Series([3, 2, 1], index=[1, 2, 3])})
df

      A    B
0  10.0  NaN
1  20.0  3.0
2  30.0  2.0
3   NaN  1.0

In [82]:
s1 = pd.Series([90, 80 ,60], index=['노', '장', '박'])
s2 = pd.Series([45, 73 ,99], index=['장', '박', '강'])
s3 = pd.Series([92, 75 ,82, 75])

In [83]:
df = pd.DataFrame({'국어': s1, '영어': s2, '수학': s3},
                  index=['노', '장', '박', '강'])
df

     국어    영어  수학
노  90.0   NaN NaN
장  80.0  45.0 NaN
박  60.0  73.0 NaN
강   NaN  99.0 NaN

In [84]:
dates = pd.date_range("20260101", periods=6, freq='W-TUE')
dates

DatetimeIndex(['2026-01-06', '2026-01-13', '2026-01-20', '2026-01-27',
               '2026-02-03', '2026-02-10'],
              dtype='datetime64[ns]', freq='W-TUE')

In [85]:
dates = pd.date_range("20260101", periods=6, freq='W-FRI')
dates

DatetimeIndex(['2026-01-02', '2026-01-09', '2026-01-16', '2026-01-23',
               '2026-01-30', '2026-02-06'],
              dtype='datetime64[ns]', freq='W-FRI')

In [87]:
dates = pd.date_range("20250101", periods=6, freq='M')
dates

C:\Users\109-1\AppData\Local\Temp\ipykernel_18220\746379463.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.date_range("20250101", periods=6, freq='M')

DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30',
               '2025-05-31', '2025-06-30'],
              dtype='datetime64[ns]', freq='ME')

In [88]:
dates = pd.date_range("20250101", periods=6, freq='MS')
dates

DatetimeIndex(['2025-01-01', '2025-02-01', '2025-03-01', '2025-04-01',
               '2025-05-01', '2025-06-01'],
              dtype='datetime64[ns]', freq='MS')

In [108]:
df2 = pd.DataFrame({
       "A": 1.0,
       "B": pd.Timestamp("20260302"),
       "C": pd.Series(np.arange(1, 3, .5)),
       "D": np.array([3] * 4, dtype="int32"),
       "E": pd.Categorical(["test", "train","test", "train"]),
       "F": "foo"
     })
df2

     A          B    C  D      E    F
0  1.0 2026-03-02  1.0  3   test  foo
1  1.0 2026-03-02  1.5  3  train  foo
2  1.0 2026-03-02  2.0  3   test  foo
3  1.0 2026-03-02  2.5  3  train  foo

In [109]:
df2.dtypes

A          float64
B    datetime64[s]
C          float64
D            int32
E         category
F           object
dtype: object

In [110]:
import pandas as pd

pf = pd.DataFrame(data = [[25, 35, 8, 18],
                          [18, 27, 10, 20],
                          [17, 17, 10, 19],
                          [12, 22, 9, 20],
                          [22, 34, 8, 16]],
                  index=['윤일형', '강수희', '홍소희',' 유한빈', '신수빈'],
                  columns=['중간', '기말', '과제', '출석'])
pf

      중간  기말  과제  출석
윤일형   25  35   8  18
강수희   18  27  10  20
홍소희   17  17  10  19
 유한빈  12  22   9  20
신수빈   22  34   8  16

In [111]:
pf['중간']

윤일형     25
강수희     18
홍소희     17
 유한빈    12
신수빈     22
Name: 중간, dtype: int64

In [112]:
pf.중간

윤일형     25
강수희     18
홍소희     17
 유한빈    12
신수빈     22
Name: 중간, dtype: int64

In [113]:
pf['출석']

윤일형     18
강수희     20
홍소희     19
 유한빈    20
신수빈     16
Name: 출석, dtype: int64

In [114]:
pf[['출석']]

      출석
윤일형   18
강수희   20
홍소희   19
 유한빈  20
신수빈   16

In [115]:
pf[['기말', '출석', '중간']]

      기말  출석  중간
윤일형   35  18  25
강수희   27  20  18
홍소희   17  19  17
 유한빈  22  20  12
신수빈   34  16  22

In [116]:
pf[['기말']]

      기말
윤일형   35
강수희   27
홍소희   17
 유한빈  22
신수빈   34

In [117]:
pf.loc['윤일형']

중간    25
기말    35
과제     8
출석    18
Name: 윤일형, dtype: int64

In [118]:
pf.loc[['윤일형']]

     중간  기말  과제  출석
윤일형  25  35   8  18

In [119]:
pf.loc[['홍소희', '윤일형']]

     중간  기말  과제  출석
홍소희  17  17  10  19
윤일형  25  35   8  18

In [132]:
pf.loc[pf.중간 > 20]

     중간  기말  과제  출석
윤일형  25  35   8  18
신수빈  22  34   8  16

In [133]:
pf.loc[(pf.중간 > 10) & (pf.과제 == 10)]

     중간  기말  과제  출석
강수희  18  27  10  20
홍소희  17  17  10  19

In [134]:
pf.loc[:, pf.columns[0]]

윤일형     25
강수희     18
홍소희     17
 유한빈    12
신수빈     22
Name: 중간, dtype: int64

In [135]:
pf.loc[:, [pf.columns[0]] ]

      중간
윤일형   25
강수희   18
홍소희   17
 유한빈  12
신수빈   22

In [136]:
pf.loc[:, pf.columns[1:]]

      기말  과제  출석
윤일형   35   8  18
강수희   27  10  20
홍소희   17  10  19
 유한빈  22   9  20
신수빈   34   8  16

In [137]:
pf.loc[:, pf.columns[1:3]]

      기말  과제
윤일형   35   8
강수희   27  10
홍소희   17  10
 유한빈  22   9
신수빈   34   8

In [138]:
pf.loc[:, pf.columns[1:]][['기말', '과제']]

      기말  과제
윤일형   35   8
강수희   27  10
홍소희   17  10
 유한빈  22   9
신수빈   34   8

In [139]:
pf.loc['윤일형', '출석']

np.int64(18)

In [141]:
pf.iloc[1]

중간    18
기말    27
과제    10
출석    20
Name: 강수희, dtype: int64

In [142]:
pf.iloc[[1]]

     중간  기말  과제  출석
강수희  18  27  10  20

In [143]:
pf.iloc[[1, 3]]

      중간  기말  과제  출석
강수희   18  27  10  20
 유한빈  12  22   9  20

In [144]:
pf.iloc[2:]

      중간  기말  과제  출석
홍소희   17  17  10  19
 유한빈  12  22   9  20
신수빈   22  34   8  16

In [145]:
pf.iloc[:, 2]

윤일형      8
강수희     10
홍소희     10
 유한빈     9
신수빈      8
Name: 과제, dtype: int64

In [146]:
pf.iloc[:, [2]]

      과제
윤일형    8
강수희   10
홍소희   10
 유한빈   9
신수빈    8

In [147]:
pf.iloc[:, 1:]

      기말  과제  출석
윤일형   35   8  18
강수희   27  10  20
홍소희   17  10  19
 유한빈  22   9  20
신수빈   34   8  16

In [148]:
pf.iloc[1,1]

np.int64(27)

In [149]:
pf.iloc[1:3,1:]

     기말  과제  출석
강수희  27  10  20
홍소희  17  10  19

In [150]:
pf.iloc[:,1]

윤일형     35
강수희     27
홍소희     17
 유한빈    22
신수빈     34
Name: 기말, dtype: int64

In [151]:
pf.iloc[[1, 3, 4], 1:]

      기말  과제  출석
강수희   27  10  20
 유한빈  22   9  20
신수빈   34   8  16

In [152]:
pf.iloc[[1, 3, 4], [0, 1]]

      중간  기말
강수희   18  27
 유한빈  12  22
신수빈   22  34

In [153]:
pf.iat[1,2]

np.int64(10)

In [154]:
pf.iat[2,3]

np.int64(19)